#pragma once
#include<DirectXMath.h>


//****************************************************************
// 
// 位置・大きさ
// 
//****************************************************************
struct Transform
{
    DirectX::XMFLOAT3 Position{0.0f,0.0f,0.0f};
    DirectX::XMFLOAT3 Scale{1.0f,1.0f,1.0f};
};


//****************************************************************
// 
//回転
// 
//****************************************************************
struct Rotate
{
    DirectX::XMFLOAT3 Angle{ 0.0f,0.0f,0.0f };
};

//****************************************************************
// 
// 速度・加速度
// 
//****************************************************************
struct Acceleration
{
    DirectX::XMFLOAT3 Velocity; //速度
    DirectX::XMFLOAT3 Speed;//速さ
    float Accel; //加速度
    float Decel; //減速度
    float MaxSpeed_h;//XZ軸の最大速度
        
};
